
&НаКлиенте
Процедура АпиЭ_ТоварыПриАктивизацииЯчейкиПосле(Элемент)
	Если Элемент.ТекущийЭлемент.Имя = "ЦенаПоставщика" Тогда

		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
		
		ЗаполнитьСписокВыбораЦенПоставщика(ТекущиеДанные, Элементы.ЦенаПоставщика.СписокВыбора)
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокВыбораЦенПоставщика(ТекущаяСтрока, СписокВыбора)

		СписокВыбора.Очистить();
		СписокВыбора.Добавить(0,"0");	
		Если ТекущаяСтрока = Неопределено Или Не ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		Иначе

			Отбор = Новый Структура();
			Отбор.Вставить("Номенклатура",ТекущаяСтрока.Номенклатура);
			СтрокиТаблицы = ТаблицаЦенЗаказа.НайтиСтроки(Отбор);
			
			Для каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
				
				СписокВыбора.Добавить(СтрокаТаблицы.Цена,Строка(СтрокаТаблицы.Цена)+"[ "+СтрокаТаблицы.ВладелецНоменклатуры+"]");	
			
			КонецЦикла;
			
		КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АпиЭ_ТоварыПриОкончанииРедактированияПосле(Элемент, НоваяСтрока, ОтменаРедактирования) 
	//Вставить содержимое обработчика  
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Номенклатура) И (НЕ ОтменаРедактирования) Тогда
		Если  (Не НоваяСтрока) И (НоменклатураТекущейСтроки <> Элемент.ТекущиеДанные.Номенклатура) Тогда 
			ИнтерфейсАпиКлиент.УдалитьНоменклатуруИзТаблицыЦен(ТаблицаЦенЗаказа,НоменклатураТекущейСтроки);
		КонецЕсли;                                                       
		//Данные о новой номенклатуре можем только добавить на сервере.   
		Если  НоваяСтрока ИЛИ (НоменклатураТекущейСтроки <> Элемент.ТекущиеДанные.Номенклатура) Тогда 
			АпиЭ_ТоварыПриОкончанииРедактированияПослеНаСервере(Элемент.ТекущиеДанные.Номенклатура);
		КонецЕсли;                                                       
	КонецЕсли;                                                       
КонецПроцедуры 

&НаСервере
Процедура АпиЭ_ТоварыПриОкончанииРедактированияПослеНаСервере(Номенклатура)
	
	ТаблицаЦен = ИнтерфейсАпиСервер.ЗаполнитьТаблицуЦенПоНоменклатуре(Номенклатура);
	
	//Заглушка - потом вынести в фоновое задание, если будет долго отвечать API.		
	РезультатЗаполнения = Обработки.ИнтерфейсAPIРусскийСвет.ЗаполнитьЦеныНоменклатурыВТаблице(ТаблицаЦен); 
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаЦен, ТаблицаЦенЗаказа);
//	Форма.ТаблицаЦенЗаказа.Загрузить(ТаблицаЦен);
	
КонецПроцедуры // АпиЭ_ТоварыПриОкончанииРедактированияПослеНаСервере()

&НаКлиенте
Процедура АпиЭ_ТоварыПриНачалеРедактированияПосле(Элемент, НоваяСтрока, Копирование)
	НоменклатураТекущейСтроки = Элемент.ТекущиеДанные.Номенклатура; 
КонецПроцедуры

&НаКлиенте
Процедура АпиЭ_ТоварыПередУдалениемПосле(Элемент, Отказ)
	ИнтерфейсАпиКлиент.УдалитьНоменклатуруИзТаблицыЦен(ЭтаФорма.ТаблицаЦенЗаказа,Элемент.ТекущиеДанные.Номенклатура);
КонецПроцедуры

//Обработчик при изменении цены поставщика
&НаКлиенте
Процедура ТоварыЦенаПоставщикаПриИзменении(Элемент)
	
	//Потом прописать Более детальный алгоритм выбора цены
	ТекущаяСтрока 		  = Элементы.Товары.ТекущиеДанные;     
	ТекущаяСтрока.ВидЦены = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
	ТекущаяСтрока.Цена    = ТекущаяСтрока.ЦенаПоставщика; 
	
КонецПроцедуры


